In [1]:
%load_ext sql

In [2]:
import configparser
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

(HOST,DB_NAME, DB_USER, DB_PASSWORD, DB_PORT) = config['CLUSTER'].values()

IAM_ROLE_ARN   = config.get("IAM_ROLE","ARN")

In [ ]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER, DB_PASSWORD, HOST, DB_PORT,DB_NAME)
print(conn_string)
%sql $conn_string

### <span style = "color:orange">1.</span> <span style = "color:teal">Query to check the records with song_id and artist_id</span>

In [ ]:
%sql SELECT * FROM songplays where song_id<>'None' and artist_id<>'None' LIMIT 5;

### <span style = "color:orange">2. <span style = "color:teal"> Query to find top 15 songs which are most frequently played by the users </span>

In [ ]:
%sql SELECT * FROM (SELECT s.song_title,a.artist_name,s.song_duration,count(*) number_of_plays FROM songplays sp \
JOIN songs s ON sp.song_id = s.song_id \
JOIN artists a ON sp.artist_id = a.artist_id \
GROUP BY sp.song_id,s.song_title,a.artist_name,s.song_duration) x \
    ORDER BY x.number_of_plays DESC LIMIT 10;

### <span style = "color:orange">3. <span style = "color:teal">Query to analyse top 5 most frequently played songs in the year 2018</span>

In [ ]:
%sql SELECT * FROM (SELECT s.song_title,a.artist_name,t.year,count(*) number_of_plays FROM songplays sp \
        INNER JOIN songs s ON sp.song_id = s.song_id \
        INNER JOIN artists a ON sp.artist_id = a.artist_id \
        INNER JOIN time t ON sp.start_time = t.start_time\
        WHERE t.year = 2018 \
        GROUP BY sp.song_id,s.song_title,a.artist_name,t.year) x \
    ORDER BY x.number_of_plays DESC LIMIT 5;

### <span style = "color:orange"> 4. <span style = "color:teal"> Query to Check the number of paid users and free users of the App</span>

In [ ]:
%sql SELECT DISTINCT(level) user_levels,count(*) FROM songplays GROUP BY user_levels;

### <span style = "color:orange">5. <span style = "color:teal">Query to analyse number of paid users per each location</span>

In [ ]:
%sql SELECT sp.location, COUNT(*) paid_users_count FROM songplays sp \
            INNER JOIN users u ON sp.user_id = u.user_id \
            WHERE u.level = 'paid' \
            GROUP BY sp.location,u.level;

### <span style = "color:orange">6. <span style = "color:teal"> Songs played by particular User </style>

In [ ]:
%sql select count(*) from users

### <span style = "color:orange">7. <span style = "color:teal"> Query to get artist, song title and song's length in the music app history that was heard during   sessionId = 781</span>

In [ ]:
%%sql 
SELECT first_name, last_name,song_title,song_duration 
FROM songplays sp
JOIN users u ON u.user_id = sp.user_id
JOIN songs s ON sp.song_id = s.song_id
WHERE session_id = 781

### <span style = "color:orange">8. <span style = "color:teal"> Query to get every user name (first and last) in my music app history who listened to the song 'All Hands Against His Own'

In [ ]:
%%sql 
SELECT u.first_name, u.last_name 
FROM users u 
JOIN songplays sp ON sp.user_id = u.user_id
JOIN songs s ON sp.song_id = s.song_id
WHERE s.song_title='Bitter Sweet Symphony'

### <span style = "color:orange">9.</span><span style = "color:teal"> Query to check if there are any duplicate records in `Users` table

In [11]:
%sql select * from (SELECT user_id,count(*) c FROM users group by user_id ) where c>1;

 * postgresql://sparkify_user:***@redshift-sparkify-cluster.cvygl1tg3ffy.eu-west-2.redshift.amazonaws.com:5439/sparkifydb
0 rows affected.

[]

In [12]:
%sql select * from users where user_id IN ('15', '16', '29', '36', '49', '80', '85', '88');

 * postgresql://sparkify_user:***@redshift-sparkify-cluster.cvygl1tg3ffy.eu-west-2.redshift.amazonaws.com:5439/sparkifydb
8 rows affected.

[('80', 'Tegan', 'Levine', 'F', 'paid'),
 ('15', 'Lily', 'Koch', 'F', 'paid'),
 ('88', 'Mohammad', 'Rodriguez', 'M', 'paid'),
 ('29', 'Jacqueline', 'Lynch', 'F', 'paid'),
 ('36', 'Matthew', 'Jones', 'M', 'paid'),
 ('85', 'Kinsley', 'Young', 'F', 'paid'),
 ('16', 'Rylan', 'George', 'M', 'paid'),
 ('49', 'Chloe', 'Cuevas', 'F', 'paid')]